Repository: FlutterNewbie/international_system_of_units
Catalog: lib/src/i18n/intl_*.arb
Languages: fr_fr

# localeMile
source: {length,plural, =0{miles}=1{mile}other{miles}}
fr_fr: {length,plural, =0{mile}=1{mile}other{miles}}

# localeInch
source: {length,plural, =0{inches}=1{inche}other{inches}}
fr_fr: {length,plural, =0{inche}=1{inche}other{inches}}

# localeMeter
source: {length,plural, =0{meters}=1{meter}other{meters}}
fr_fr: {length,plural, =0{mètre}=1{mètre}other{mètres}}

# localeKilometer
source: {length,plural, =0{kilometers}=1{kilometer}other{kilometers}}
fr_fr: {length,plural, =0{kilomètre}=1{kilomètre}other{kilomètres}}

# localeTon
source: {value,plural, =0{tons}=1{ton}other{tons}}
fr_fr: {value,plural, =0{tonne}=1{tonne}other{tonnes}}

# localePound
source: {value,plural, =0{pounds}=1{pound}other{pounds}}
fr_fr: {value,plural, =0{pound}=1{pound}other{pounds}}

# localeKilogram
source: {value,plural, =0{kilograms}=1{kilogram}other{kilograms}}
fr_fr: {value,plural, =0{kilogramme}=1{kilogramme}other{kilogrammes}}

# localeSecond
source: {time,plural, =0{seconds}=1{second}other{seconds}}
fr_fr: {time,plural, =0{seconde}=1{seconde}other{secondes}}

# localeHour
source: {time,plural, =0{hours}=1{hour}other{hours}}
fr_fr: {time,plural, =0{heure}=1{heure}other{heures}}

# localeDay
source: {time,plural, =0{days}=1{day}other{days}}
fr_fr: {time,plural, =0{jour}=1{jour}other{jours}}

# localeLiter
source: {volume,plural, =0{liters}=1{liter}other{liters}}
fr_fr: {volume,plural, =0{litre}=1{litre}other{litres}}

# localeGallon
source: {volume,plural, =0{gallons}=1{gallon}other{gallons}}
fr_fr: {volume,plural, =0{gallon}=1{gallon}other{gallons}}

# _intlImperialGallonsPerMiles
source: imp {gallons} per {miles}
fr_fr: imp {gallons} par {miles}

# _intlUsGallonsPerMiles
source: US {gallons} per {miles}
fr_fr: US {gallons} par {miles}

# _intlLitersPerMeters
source: {liters} per {meters}
fr_fr: {liters} par {meters}

# _intlLitersPerKilometers
source: {liters} per {kilometers}
fr_fr: {liters} par {kilometers}

# _intlKilometersPerLiters
source: {kilometers} per {liters}
fr_fr: {kilometers} par {liters}

# _intlMeterPerLiter
source: {meters} per {liters}
fr_fr: {meters} par {liters}

# _intlMilePerImperialGallon
source: {miles} per imp {gallons}
fr_fr: {miles} par imp {gallons}

# _intlMilePerUsGallon
source: {miles} per US {gallons}
fr_fr: {miles} par US {gallons}
